"{\"datasetId\": 3462333, \"datasetSlug\": \"student-performance-multiple-linear-regression\", \"ownerUser\": \"nikhil7280\", \"usabilityRating\": 1.0, \"totalViews\": 207108, \"totalVotes\": 295, \"totalDownloads\": 58097, \"title\": \"Student Performance (Multiple Linear Regression)\", \"subtitle\": \"Exploring Factors Affecting Student Performance\", \"description\": \"# **Description:**\\nThe Student Performance Dataset is a dataset designed to examine the factors influencing academic student performance. The dataset consists of 10,000 student records, with each record containing information about various predictors and a performance index.\\n\\n\\n## **Variables:**\\n\\n- **Hours Studied**: The total number of hours spent studying by each student.\\n- **Previous Scores**: The scores obtained by students in previous tests.\\n- **Extracurricular Activities**: Whether the student participates in extracurricular activities (Yes or No).\\n- **Sleep Hours**: The average number of hours of sleep the student had per day.\\n- **Sample Question Papers Practiced**: The number of sample question papers the student practiced.\\n\\n**Target Variable**:\\n- **Performance Index**: A measure of the overall performance of each student. The performance index represents the student's academic performance and has been rounded to the nearest integer. The index ranges from 10 to 100, with higher values indicating better performance.\\n\\nThe dataset aims to provide insights into the relationship between the predictor variables and the performance index. Researchers and data analysts can use this dataset to explore the impact of studying hours, previous scores, extracurricular activities, sleep hours, and sample question papers on student performance.\\n\\n**P.S**: Please note that this dataset is synthetic and created for illustrative purposes. The relationships between the variables and the performance index may not reflect real-world scenarios\\n\\n## **License**: \\nAnyone is free to share and use the data\", \"keywords\": [\"education\", \"beginner\", \"linear regression\", \"tabular\"], \"licenses\": [{\"name\": \"other\"}]}"